
#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <stdio.h>
#include <clocale>   


int main()
{
    setlocale(LC_ALL, "Russian");
    char name1[12], name2[7], name3[12];
    int sc1, sc2, sc3;
    int cnt1, cnt2, cnt3;
    char sq1, sq2, sq3;
    /* Введение фактических данных*/
    printf("1. Введите: Процессор, частоту, ram, тип >");
    scanf("%s %d %d %c", name1, &sc1, &cnt1, &sq1);
    printf("2. Введите: Процессор, частоту, ram, тип >");
    scanf("%s %d %d %c", name2, &sc2, &cnt2, &sq2);
    printf("3. Введите: Процессор, частоту, ram, тип >");
    scanf("%s %d %d %c", name3, &sc3, &cnt3, &sq3);

    /* Вывод таблицы */
    /* вывод заголовков */
    printf("---------------------------------------------------\n");
    printf("| Характеристики ПЭВМ                             |\n");
    printf("|-------------------------------------------------|\n");
    printf("| Процессор | Частота |     Ram     |     Тип     |\n");
    printf("|           |         |             |             |\n");
    printf("|-----------|---------|-------------|-------------|\n");
    /* вывод строк фактических данных */                      
    printf("|%-11s|%-3d      |%-3d          |%-c            |\n", name1, sc1, cnt1, sq1);
    printf("|-----------|---------|-------------|-------------|\n");
    printf("|%-6s     |%-3d      |%-3d          |%-c            |\n", name2, sc2, cnt2, sq2);
    printf("|-----------|---------|-------------|-------------|\n");
    printf("|%-11s|%-4d     |%-3d          |%-c            |\n", name3, sc3, cnt3, sq3);
    /* вывод примечаний */
    printf("|-------------------------------------------------|\n");
    printf("|Тип: C - CISC-процессор, R - RISC-процессор      |\n");
    printf("---------------------------------------------------\n");
    return 0;







}


// printf("|-----------|---------|-------------|-------------|\n"); 
   //printf("|                              |\n");